var chats = document.getElementById("message-frends");
var members = [
    ["정시은", "..."], ["홍은정", "..."], ["이동연", "..."],
    ["함라희", "..."], ["고무성", "..."], ["박건희", "..."],
    ["정서현", "..."], ["장현준", "..."], ["김민규", "..."],
    ["김명원", "..."], ["유익환", "..."], ["송민준", "..."],
    ["양주은", "..."], ["김은서", "..."], ["윤현준", "..."],
    ["박종빈", "..."], ["유강희", "..."], ["이호", "..."],
    ["인성", "..."], ["주한", "..."], ["현제", "..."],
    ["최민수", "..."], ["장하나", "..."], ["강상오", "..."],
    ["김가람", "..."], ["김재성", "..."], ["대현", "..."],
    ["정훈", "..."], ["김나영", "..."], ["마카르", "..."],
    ["지연", "..."], ["신하윤", "..."], ["리나", "..."],
    ["문수빈", "..."], ["최지원", "..."], ["레일라", "..."],
    ["이수빈", "..."], ["오수아", "..."], ["김대성", "..."],
    ["서민관", "..."], ["김민규", "..."], ["김이삭", "..."],
    ["윤나래", "..."], ["이강호", "..."], ["서명진", "..."],
    ["민준", "..."], ["연제", "..."], ["이현준", "..."],
    ["백소연", "..."], ["심태민", "..."], ["유가람", "..."],
    ["박시연", "..."], ["막장집", "..."], ["박시후", "..."],
    ["이준", "..."], ["현준", "..."], ["방은찬", "..."],
    ["김화평", "..."], ["김한결", "..."], ["자스민", "..."],
    ["유원동", "..."], ["태준", "..."], ["한윤기", "..."],
    ["김태완", "..."], ["찬솔", "..."], ["김유주", "..."],
    ["김게나", "..."], ["이학승", "..."], ["이하윤", "..."],
    ["기보경", "..."], ["남희건", "..."], ["정다훈", "..."],
    ["좇평이", "..."], ["이지호", "..."], ["이민혁", "..."],
    ["김준혁", "..."], ["사니야", "..."], ["김서우", "..."],
    ["선우", "..."], ["홍택", "..."], ["이준", "..."],
    ["서유빈", "..."], ["성효", "..."], ["이지담", "..."],
    ["호원", "..."], ["연희", "..."], ["아야", "..."],
    ["김민준", "..."], ["정후", "..."], ["문희정", "..."],
    ["지한", "..."], ["김지환", "..."], ["이인혁", "..."],
    ["강채빈", "..."], ["유석양", "..."], ["정현석", "..."],
    ["장주원", "..."], ["이예원", "..."], ["노윤진", "..."],
    ["문희정", "..."], ["문희정", "..."], ["문희정", "..."],
    ["조경우", "..."], ["최서희", "..."], ["한지호", "..."],
    ["천안상업고등학교", "..."], ["김민찬", "..."], ["태규", "..."],
    ["김강혁", "..."], ["김강현", "..."], ["정대호", "..."],
    ["이정후", "..."], ["경민", "..."], ["김본부", "..."],
    ["전재희", "..."], ["오승민", "..."], ["박영광", "..."],
    ["안예람", "..."], ["남유하", "..."], ["미카", "..."],
    ["권순혁", "..."], ["이지환", "..."], ["서동현", "..."],
    ["임유겸", "..."], ["이지혜", "..."], ["창현", "..."],
    ["박금빛", "..."], ["최원우", "..."], ["한성", "..."],
    ["카르", "..."], ["기범", "..."], ["스티븐", "..."],
    ["알리나", "..."], ["탠탠", "..."], ["정윰민", "..."],
];

for (let i = 0; i < members.length - 1; i++) {
    let content = `
        <div class="message-frend" id="${members[i][0]}">
            <div class="message-frend-image">
                <img src="https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460_960_720.png" alt="">
            </div>
            <div class="message-frend-info">
                <div class="message-frend-title">${members[i][0]}</div>
                <div class="message-frend-content">
                    ${members[i][1]} <span> · ${i * Math.round(Math.random() * i)}시간</span>
                </div>
            </div>
        </div>
    `
    chats.insertAdjacentHTML("beforeend", content)
}

document.querySelectorAll(".message-frend").forEach(function(friend) {
    friend.addEventListener("click", function() {
        let name = {
            "name": this.id,
            "username": this.id
        };
        localStorage.setItem("user", JSON.stringify(name));
        location.href = "chat.html";
    })
})
